Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: tm/5pice_ceshi-omegat.tmx
Source language: en_us
Languages: zh_cn

source: This function will only affect things drawn in the Draw GUI Event and can be used to set a specific width and height for all GUI components in that event, and no matter what size of display or window is used to display the GUI, it will be scaled to fit correctly.
zh_cn: 此函数只会影响 Draw GUI Event 中的绘制的内容，并可以用来给那个事件中所有GUI组件设定特定的宽度和高度， 不管显示器或窗口之前是怎样显示GUI，都会缩放到适当的效果。

source: This function will populate a pre-made ds_map with a series of key/value pairs for the first local push notification in the queue to be shown.
zh_cn: 这个函数将以一系列键值对儿（key/value pairs）的形式返回一个 ds_map作为本地通知队列中最先被显示的通知。

source: This function will populate a pre-made ds_map with a series of key/value pairs for the next local push notification in the queue to be shown.
zh_cn: 这个函数以一系列键值对儿（key/value pairs）的形式返回一个 ds_map 作为本地通知队列中下一个被显示的通知。

source: This function will resize a surface to the given dimensions (in pixels).
zh_cn: 这个函数将重置表面的大小为给定的长宽值（像素）。

source: This function will return true if the application surface is being used for drawing, or false if the screen buffer is being used.
zh_cn: 如果使用应用表面层，这个函数将返回 真 ， 或者如果使用屏幕缓存区返回 假。

source: This function will return one of two constant GameMaker: Studio has to tell you whether the device running the game is being held in landscape or portrait mode:
zh_cn: 这个函数返回 GameMaker: Studio常量中的一个，告诉你运行游戏的设备是在横向模式还是纵向模式。

source: This function will return the current d3d device pointer, which you can then (for example) pass through to a DLL.
zh_cn: 这个函数将返回当前d3d设备的 指针，然后你可以传递给DLL。

source: This function will return the height of the display (in pixels).
zh_cn: 这个函数将返回显示器的高度（像素为单位）。

source: This function will return the hue of the given colour.
zh_cn: 这个函数将返回给定颜色的色相。

source: This function will return the mouse x position relative to the view selected.
zh_cn: 这个函数将返回相对于所选视野的鼠标x坐标。

source: This function will return the mouse x position within the screen.
zh_cn: 这个函数返回 屏幕上鼠标指针的x坐标。

source: This function will return the mouse y position relative to the view selected.
zh_cn: 这个函数将返回相对于所选视野的鼠标y坐标。

source: This function will return the mouse y position within the screen.
zh_cn: 这个函数返回 屏幕鼠标位置的x坐标。

source: This function will return the saturation of the given colour.
zh_cn: 这个函数将返回给定颜色的饱和度。

source: This function will return the smallest angle difference between two angles as a value between -180 and 180 degrees (where a positive angle is anti-clockwise and a negative angle clockwise).
zh_cn: 这个函数将会返回两个角的最小角度差.

source: This function will return the value (luminosity) of the given colour.
zh_cn: 这个函数将返回给定颜色的明度。

source: This function will return the width of the display (in pixels).
zh_cn: 这个函数将返回显示器的宽度（以像素为单位）。

source: This function will save a part of a surface to disc using the given filename.
zh_cn: 此函数将使用给定的文件名保存表面层到硬盘上。

source: This function will save a surface to disc using the given filename.
zh_cn: 此函数将使用给定的文件名保存表面层到硬盘上。

source: This function will send off to the cloud for data, which will then trigger the appropriate asynchronous event.
zh_cn: 这个函数用于向云端发送数据, 并触发相应的异步事件。

source: This function would be called in an event like the Game Start Event or in an object that is placed in the first room of your game, with the idea being that you check the current data blob from the cloud server to see if it is up to date or not.
zh_cn: 这个函数会在 开始事件（Game Start Event） 或者当一个 object 被放置在你的游戏的第一个房间中时被调用，通过这种思路来从云端服务器检查是否有数据更新。

source: This function would normally be called at the start of a new game and is used to retrieve the current status of the cloud service at game start up.
zh_cn: 这个函数通常在新的游戏的开始被调用，用于检索云端服务器上存储的游戏的启动。

source: This global scope, built-in variable can be used to access the application surface using any of the surface functions.
zh_cn: 在全局的范围内，这个内置变量可以访问应用表面层，任何表面层函数都可以使用它。

source: This has two benefits - One, we don't have to worry about typos or errors when writing out the array positions, and two, we have in the variable "count" the number of positions that the array contains, which can then be used elsewhere in the object.
zh_cn: 这样做有两个好处。一来可以避免打错数字，二来可以使用count这个变量计算数组包含数据的个数，这个变量可以用到物体的其它地方。

source: This help file will tell you the most important things you need to know about GameMaker: Studio and how you can create your own games with it.
zh_cn: 该帮助文件会告诉你你需要知道关于 GameMaker: Studio 的最重要的事情以及您可以如何使用它创建自己的游戏。

source: This index of the grid to clear.
zh_cn: 待清空的栅格的索引。

source: This index of the grid to copy from.
zh_cn: 待拷贝的栅格

source: This index of the grid to copy to.
zh_cn: 待拷贝到的栅格

source: This is a 1D (one dimensional) array which we are now going to break down the parts of to see what it means:
zh_cn: 这是一个一维数组。看起来没什么特别的吧？下面我们把它分解开来看：

source: This is a very important thing to remember as instances and objects are not the same thing and each have their own set of functions that can affect them.
zh_cn: 这很重要，因为这意味着物体和实例 不 同，每一个实例均有自己的一套功能。

source: This is achieved by a variety of means, with the keyboard and mouse on computers and through touch and tilting on mobile devices.
zh_cn: 有多种方法可以实现交互，比如电脑的键盘、鼠标，移动设备的触摸和倾斜。

source: This is almost the same as the shift button but in this case a copy of the moments are made.
zh_cn: 这个按钮的作用和平移按钮很类似，只不过这个按钮会创建一份时刻的拷贝。

source: This is because it is stored in the texture memory and may be overwritten when the target platform needs that memory for something else which means that you should always have some type of fail-safe code in place, usually with the surface_exists function.
zh_cn: 这是因为它储存在显存里，目标平台往内存里写入其它东西时就有可能会重写，所以你需要一直 在某些位置入置安全的代码，通常是 surface_exists 函数。

source: This is because the internal ID values for data structures or instances are integers and so the Debug Module doesn't always know if the integer value being stored in a variable is for a data structure or an instance or is simply an integer value.
zh_cn: 这是因为数据结构或者实例的内部ID值是整数型的，所以调试模块不总是知道变量中存储的整数型值是数据结构还是实例还是仅仅一个简单的整数。

source: This is because using the point method to access or change another instances value will give an error and crash the game if the instance does not exist.
zh_cn: 这是因为如果实例不存在的话，使用“.”的方法访问或改变实例的值将会报错以至游戏崩溃。

source: This is called "inheritance" and an object that has a parent is called a "child".
zh_cn: 这就是所谓的 "继承"，有父对的物体被称为 "child (子对)"。

source: This is done by simply pausing the game and then clicking on any visible instance within the game window.
zh_cn: 暂停游戏，只需要点击游戏窗口中任何可见的实例，你就能实现该功能。

source: This is done using "watch windows" which are opened on the right hand side of the debug module.
zh_cn: 这个目的要使用调式模块右手边打开的监视窗口来实现。

source: This is due to the way the Debug Module works and is essential for debugging mobile platforms.
zh_cn: 这是由于调试模块独特的工作方式，并且这也对调试移动平台至关重要。

source: This is essentially a surface, just like any that you can make yourself using the surface functions, and as such can be manipulated with the surface functions, drawn to, sent to shaders and anything else that you would normally do with surface are also applicable to this.
zh_cn: 应用表面层本质上是一种表面层，可以随心所欲的使用表面层函数，并因此可以操作表面层函数，绘制、发送到着色器，通常表面可以做到的，应用表面层也可以。

source: This is handy for when you have, for example, a main character that moves from room to room and you want to maintain the variables within that object the same, but unless you take great care to create and destroy persistent objects correctly, you can easily get errors creeping into your project.
zh_cn: 然而这需要你保持一个清晰的思路，如果没有正确地创建或摧毁它，就很有可能影响整个工程。

source: This is ideal for those games that have aspect ratio correction set in the global Game Settings.
zh_cn: 这是已经在全局游戏设置中开启长宽比校正的理想选择。

source: This is important to remember as it means that you have to do a certain amount of planning before using arrays, but it is easy enough to initialize one using a repeat loop like this...
zh_cn: 换句话说就是需要我们在使用数组之前就做好规划，可以像这样简单的使用“repeat”循环初始一个数组。

source: This is just one of the ways that you can permit multiple configurations for movement in your games.
zh_cn: 这仅是允许多个设置处理移动的一种方法。

source: This is not always possible, but due to the optimised way in which GameMaker: Studio draws to the screen, it is recommended that you keep all draw functions within the draw event.
zh_cn: 并不强求这样，但是根据GameMaker: Studio 绘制到屏幕的优化方式，建议绘制事件中使用所有的绘制函数。

source: This is not exactly necessary on certain platforms (like Windows and MacOS) but it will certainly increase compatibility on those targets, while for HTML5 and devices it is essential and very it's important that you remember this or you may run into problems later.
zh_cn: 不是所有的平台都有必要这样做（比如Windows和MacOS），但是这样做肯定也会增加那些平台的兼容性。然而，对于HTML5和其它设备，记住这非常重要，或许你以后就会出现问题。

source: This is not strictly necessary but is the optimal way to do it as it will reserve a space in memory that is the exact size of the array, whereas if you initialize an array from 0 upwards, the memory has to be re-allocated for every additional value added.
zh_cn: 不是严格必要，但却是最好的方式，因为这样会精确地在内存中保留一个数组空间，而如果你从零开始初始化，内存将在每一次添加值时重新分配。

source: This is only for use in the draw event of an instance (it will not show if used in any other event), and it can also be very useful for clearing surfaces when they are newly created.
zh_cn: 它仅能用于实例的draw事件（用于其它事件时不发挥作用）。当新建表面时，它也可用于填充 表面 。

source: This is particularly useful when you want a loose overview of all your actions, code and events or if you want to debug something within the object.
zh_cn: 当你想要对你的物体有个大体了解这将非常有用。

source: This is simply done by clicking the left mouse button on a point where you want the path to pass through, with a green square signifying the start of the path, a red dot being the current path point, and a blue dot being a normal path point (the path itself is drawn as a yellow line).
zh_cn: 这只需要简单的在你想让你的路径通过的位置上点击鼠标左键即可。 同时，路径的起点会用绿色的方块标出，当前的路径点用红色的点表示，而蓝色的点代表的是一个普通的路径点（路径本身是一条黄色的线）。

source: This is supported by GameMaker: Studio on the iOS, Android, Tizen (Native and JaveScript) target modules.
zh_cn: GameMaker: Studio目前已支持 iOS, Android, Tizen (Native and JaveScript) 平台。

source: This is the "pure" colour tone which is part of the hue, saturation and value (luminosity) method for defining a colour.
zh_cn: 色相是一个“纯粹”的色调颜色，它是色彩的三元素（H-色调、S-饱和度、V-明度）之一。

source: This is the Project Number that is assigned when you create your Google Play API Project.
zh_cn: Project Number 在你创建安卓工程时被创建。

source: This is the amount of the "light" that is mixed into the final colour and is part of the hue, saturation and value method for defining a colour.
zh_cn: 明度指色彩的亮度，它是色彩的三元素（H-色调、S-饱和度、V-明度）之一。

source: This is the amount of the colour tone that is mixed into the final colour and is part of the hue, saturation and value (luminosity) method for defining a colour.
zh_cn: 饱和度指色彩的鲜艳（纯色）程度，它是色彩的三元素（H-色调、S-饱和度、V-明度）之一。

source: This is the area where you will be editing your resources, setting up rooms and working with your objects, code and all other resources.
zh_cn: 在这个区域你可以编辑资源、创建房间、修改物体 、code (代码) 和其他资源。

source: This is the array's name.
zh_cn: 数组的名字。

source: This is the default method and is the one recommended by Nvidia - it should give the highest performance.
zh_cn: 这是默认的，且是Nvidia推荐的方法 - 它应该是最高的性能。

source: This is the deprecated method that GameMaker: Studio used to use before adopting the fast method - poorer performance on newer machines
zh_cn: 这是在采用快速方法之前（vbm_fast），GameMaker: Studio 曾经使用过的一个过时的方法 - 在较新的机器上性能较差。

source: This is the legacy method that was used in previous versions of GameMaker - performance is poorer than the other two, but it should be compatible with almost any machine.
zh_cn: 这是 GameMaker 之前使用的一个传统方法 - 性能不如上面两个，但是应该兼容几乎任何一台机器。

source: This is the letter that will be underlined in the IDE, meaning that you can also use the <ALT> key plus the underlined character key to call the command.
zh_cn: 这些字母将会带上下划线，这意味着你也可以通过按下 <ALT> 键加上该字母来调用该命令。

source: This is the main interface for GameMaker: Studio and it's here that you control every aspect of your current project.
zh_cn: 这是 GameMaker: Studio 的主界面，在这里你可以控制你当前工程的各个方面。

source: This is the position within the array that we are checking or changing.
zh_cn: 这部分指明我们现在所引用的数据在数组中的位置。

source: This is triggered when two instances of any objects collide in the game room.
zh_cn: 这会发生在房间中任意两个实例发生碰撞的时候。

source: This is useful for grouping objects and things of the same type together for easy referencing.
zh_cn: 用于对资源更好地分类。

source: This is usually defined by the sprite itself (and can be changed in the sprite editor) but sometimes you may want an object to have a different shaped mask to its sprite, or even have no sprite but still a mask.
zh_cn: 这通常定义于精灵本身 (可以在精灵编辑器修改)，但有时你可能想要让物体拥有和精灵不同形状的遮罩，甚至 没有 精灵但却有一个遮罩。This is usually defined by the sprite itself (and can be changed in the sprite editor) but sometimes you may want an object to have a different shaped mask to its sprite, or even have no sprite but still a mask.

source: This is very handy as it means you can make changes to the volume using the slider at the bottom of the window and hear what the effect it will have on the sound.
zh_cn: 这使得你可以使用窗口底部的音量按钮调整音量大小。

source: This is very handy when you have a large project with many resources in grouped sub-folders.
zh_cn: 当你有一个含有很多子文件夹的大工程时这非常方便。

source: This is very useful for transferring a project over a network as well as for storing shelved projects or backup copies of a current project.
zh_cn: 这被用于网络项目或者备份。

source: This language gives you much more flexibility and control over your games than the standard actions and we will refer to it as GML (the GameMaker Language).
zh_cn: 这种语言比使用标准化动作将赋予您更多设计的弹性和更标准化的对游戏设计的控制，这里称为 GML (the GameMaker Language)。

source: This last part is only ever valid when the event is a collision event or there is a with used in the code.
zh_cn: 这最后部分仅在当事件是碰撞事件或者代码中有with时才会有效。

source: This loop will continue until the expression is found to be false.
zh_cn: 如此循环，直到表达式为假。

source: This means that everything that is shown in the chosen view will now be drawn to the assigned surface.
zh_cn: 这意味着所选视野内的所有显示的画面将被绘制到指定的表面。

source: This means that if the device or window loses focus or is minimised (good examples are when a screensaver comes up in Windows, or on an Android device when the app loses focus due to a call) then the surface may be destroyed.
zh_cn: 这意味着，如果设备或窗口失去焦点或最小化（很好的例子是，当Windows弹出屏幕保护程序或Android 设备来电话时应用程序失去焦点的情况），表面可能会被破坏。

source: This means that if you place a persistent object in one room, it will still be available in all subsequent rooms and will continue to perform any actions assigned to the events in its object properties.
zh_cn: 这意味着它会在下一个房间里继续执行动作，这是很方便的。

source: This means that it can be useful to know what part of this area you are looking at while designing your path and this is shown by the Area values, with the first set of coordinates being the upper left corner of the current view, and the second set of coordinates being the lower right corner.
zh_cn: 这也意味着你在设计路径时搞清楚当前究竟位于什么位置很有必要，而这可以通过观察 Area 值来了解——第一对坐标表示了当前视角左上角的坐标，而第二对坐标表示右下角的坐标。

source: This means that they will run on both iPhone and iPad devices without problems.
zh_cn: 这意味着所有的iPhone和ipad均可运行您的游戏。

source: This means that when the view reaches the edge of a room, the horizontal and vertical borders are ignored and the instance will move freely within the view.
zh_cn: 这意味着当视野抵达房间的边缘，会忽略视野的横向或纵向边界，实例将在视野内自由移动。

source: This means that you must always return the array from the script if you wish to change any array values.
zh_cn: 这也意味着，如果你想更改数组里的任何值，你 必须在脚本中返回这个数组 。

source: This means that you can create a hierarchy "switch" in which different sections of code are run depending on the input value.
zh_cn: 这意味着你可以创建一个分层的“开关”，根据输入值运行不同部分的代码。

source: This means that you can use views to draw HUD elements or to have split screen effects for example.
zh_cn: 这意味着可以使用视野绘制HUD界面（抬头显视系统，如血条、金钱），或者分裂屏幕效果。

source: This means that you may need to convert absolute coordinates into local coordinates for the surface.
zh_cn: 这意味着你可能需要为表面转换坐标，从绝对坐标转换到局部坐标系。

source: This means that you should have some method in place that scales the game to the required device, window or screen dimensions.
zh_cn: 这意味着，你需要额外的方法设置缩放到设备、窗口或屏幕相应的尺寸上。

source: This news includes information about GameMaker: Studio development, new versions, competitions and anything else that has been posted on the YoYo Games website.
zh_cn: 这些新闻包括 GameMaker: Studio 的开发信息、新版本、比赛和其他任何张贴在 YoYo Games 网站的内容。

source: This option is especially useful for those that wish to make use of the Configurations Manager to store certain configurations and export specific files depending on them.
zh_cn: 这个功能在你想要用 配置管理器 来储存特定的配置和解包相关文件时显得尤为有用。

source: This page outlines the options available to you from the GameMaker: Studio GUI.
zh_cn: 这个页面列出了 GameMaker: Studio GUI 的菜单选项。

source: This player will be empty to start with as you must first visit the Steam Workshop and subscribe to the games that you wish to play.
zh_cn: 这个播放器一开始是空的，你必须先访问 Steam Workshop 并且 subscribe (订阅) 你想玩的游戏。

source: This redundancy is there so that you can get working with GameMaker: Studio in the easiest and most natural way, using whatever system you feel most comfortable with.
zh_cn: 这是因为 GameMaker: Studio 想要给你一个最简单、最自然的工作环境，让你觉得舒适。

source: This screen shot is saved to a specific directory and numbered using a variable which is then incremented.
zh_cn: 截图保存在特定的目录里，其编号使用一个变量递增后得到。

source: This section contains all the information on the Game Maker Language
zh_cn: 这部分包含GML语言（Game Maker Language）的所有信息。

source: This section contains an overview of the GameMaker Language, with the rules for structure and syntax, as well as examples of how to use expressions and different operations:
zh_cn: 这分包含一份GML语言的概述，包括结构规则和语法，以及怎样使用表达式和不同运算的例子：

source: This section covers the "continue" statement.
zh_cn: 这一句含盖“continue”语句。

source: This section deals with arrays, special variables that can hold more than one value.
zh_cn: 这一部分讨论数组，一个可以容纳超过一个值的特殊变量。

source: This section deals with including external files in your game.
zh_cn: 本节讲述了如何包含外部文件到你的游戏中。

source: This section deals with the "while" statement and its use
zh_cn: 这节将处理“while”语句及其使用。

source: This section deals with the GameMaker: Studio path editor.
zh_cn: 这一章讲述了如何使用 GameMaker: Studio 的路径编辑器。

source: This section deals with the Game Information window.
zh_cn: 这部分详细讲解了游戏信息窗口。

source: This section deals with the application surface and the functions specific to it.
zh_cn: 本节论述了应用表面层，以及它的特定函数。

source: This section deals with the different mathematical expressions.
zh_cn: 这一节集中讲述了不同的数学表达式。

source: This section deals with the font resource.
zh_cn: 这一节讲述了如何使用字体资源。

source: This section deals with the functions for defining view properties.
zh_cn: 本节论述了定义视野的相关函数。

source: This section deals with the functions for manipulating views and the game window.
zh_cn: 这部分讨论操作视野和游戏窗口的函数。

source: This section deals with the functions for pushing notifications to devices.
zh_cn: 这一章节说明与设备上消息推送的有关函数。

source: This section deals with the functions related to creating and manipulating surfaces.
zh_cn: 这一节讨论了创建与操作表面的一系列函数。

source: This section deals with the uses of "switch" in GameMaker: Studio.
zh_cn: 这一节讨论 GameMaker: Studio里“switch”的用法。

source: This section deals with timeline functions.
zh_cn: 这一节 deals with timeline functions.

source: This section describes the basic use of GameMaker: Studio, explaining the idea behind the program and describing how to add sprites, backgrounds and sounds.
zh_cn: 这一节描述了GameMaker: Studio的基本用法，解释程序背后的想法， 描述如何添加精灵、 背景和声音。

source: This section explains how to add a sound resource to your game.
zh_cn: 本节说明了如何为你的游戏添加声音资源。

source: This section explains how to use "repeat".
zh_cn: 这节解释如何使用“repeat”。

source: This section explains how to use the Debug Module to find and correct errors or issues in your games.
zh_cn: 这部分阐述如何使用调试模块去寻找并且纠正游戏中的错误或问题。

source: This section explains some of the some of the core concepts of how GameMaker: Studio works so you can start making games as quick as possible.
zh_cn: 这部分解释了 GameMaker: Studio 工作的核心概念，这样您就可以尽快开始制作游戏。

source: This section explains the use of "for".
zh_cn: 这一节解释“For”的用法。

source: This section explains the various assignments available.
zh_cn: 本篇文章是与变量赋值相关的内容。

source: This section explains the various uses for the "break" statement.
zh_cn: 这一节解释“break”语句的用法。

source: This section explains vectors and lists some vector based functions
zh_cn: 这节解释了向量并列举了一些基于向量的函数。

source: This section explains what a function is in GameMaker: Studio
zh_cn: 这部分解释了在GameMaker: Studio中函数是什么。

source: This section has all the functions related to the game window
zh_cn: 这部分介绍游戏窗口的所有函数。

source: This section is designed to explain some of the advanced functions to be found in the GameMaker: Studio IDE.
zh_cn: 本节会阑述一些高级的功能，这些功能在 GameMaker: Studio 开发环境中都可以找到。

source: This section lists the differences between versions of GameMaker: Studio.
zh_cn: 这部分列出了不同版本 GameMaker: Studio 之间的区别。

source: This section lists the various menus that are in the GUI.
zh_cn: 这部分列出了 GUI 界面的所有菜单。

source: This section of the help file gives you all the information you need for creating your first games.
zh_cn: 这部分帮助文档给您提供您创建第一个游戏所需的所有信息。.

source: This section of the manual has all the functions relating to user input from devices.
zh_cn: 手册的这一部分拥有所有设备输入相关的函数。

source: This section of the manual is split into the following three parts, each with its own subsection dealing with one particular aspect of the IDE:
zh_cn: 这部分手册分为三部分，每一部分都有一个分段，处理IDE独立的某个方面：

source: This section outlines how to use the "if" statement
zh_cn: 这节概述了如何使用"if"语句。

source: This should never contain spaces nor unauthorized characters and should be short but memorable so that you can easily identify resources later when you may have many of them, for example may people use a prefix or a suffix to identify the differences between resources, like "obj_Ship" or "Ship_obj".
zh_cn: 可以的话加上 obj 前缀或后缀加以区别会有好处。

source: This simple code will initialize a ten position array (0-9) to 0, in that each position in the array contains the value 0.
zh_cn: 这个简单的代码将初始十个位置（0-9）的数组为0，数组的每个位置储存的数值都是0。

source: This simply means that you can tell your game to run the current line of code, then step onto the next one, permitting you to run through your entire game one line of code at a time should you wish.
zh_cn: 这意味着你可以告诉你的游戏运行代码中的当前行，之后跳转到下一行。只要你想，就允许你跨越整个游戏来运行一行代码。

source: This stretches the game window to accommodate both ports and uses the window colour to colour the background where no view is shown.
zh_cn: 拉伸游戏窗口容纳两个视野输出，并用窗口颜色填充没有视野画面的区域。

source: This surface is basically a blank "canvas" that can then later be manipulated before being drawn to the screen when needed, and in most cases GameMaker: Studio handles this for you (although you can also manipulate it yourself in code for shaders, scaling and many other things - further details are given below).
zh_cn: 表面层基本上是一个空的“画布”，创建后在绘制到屏幕之前，根据你的需要进行操作。多数情况下， GameMaker: Studio 已经为你作了处理（然而你也可以在代码中自己处理，使用到着色器、缩放或其它操作，详细下面会讲到）。

source: This surface is permanently available and is where the bulk of drawing is done by GameMaker: Studio.
zh_cn: 在 GameMaker: Studio所有块绘制完成的同时，这个表面会永久存在。

source: This target will permit you to publish your Windows games straight to Steam for others to download and play.
zh_cn: 这将允许你直接发布你的windows游戏以提供 Steam 上的其他玩家下载和玩。

source: This time however you should press the button marked "Update Game", which will download all the details of the games you have already uploaded to the Workshop (this may take a few moments depending on the number of games that you have there).
zh_cn: 这个时候你应该按下 "Update Game (更新游戏)" 按钮，它会下载所有准备上传到创意工坊的游戏细节 (可能需要几分钟，取决于你的游戏数量)。

source: This type of notification is useful to set "reminders" for the user to play your game again, or to offer a daily reward for playing, etc... and when the user taps the notification it will launch the game and pass in a data string which can then be parsed by the game to give a reward or whatever.
zh_cn: 这种类型的通知用于“召回”玩家再次运行游戏，或者用于每日奖励之类的事件......用户点击通知将启动游戏并传递一个字符串，解析数据来给玩家发放奖励或者进行其他你想要的操作。
